package com.example.myapplication7;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import java.util.ArrayList;

public class MainActivity2 extends AppCompatActivity {

    ArrayList<Books> BooksArrayList = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);



        Books books = new Books("الطنطورية","للكاتبة : رضوى عاشور"," تروي رواية الطنطورية أحداثًا تاريخية عاشتها فلسطين، بدأت الرواية باستقرار الوضع وتغير بمجرد انتشار قرار تقسيم فلسطين، وبعد هذا التقسيم ستدخل كل من الطنطورية وخط الساحل من جنوب عكا إلى جنوب يافا إلى منطقة اليهود.  لم يقبل الأهالي بذلك فكانوا يقيمون الاجتماعات للبحث عن حل لتلك المصيبة التي حلت بهم.  انتفض العرب على اليهود انتقامًا منهم وردًا على الهجوم الذي شنوه عليهم. بعد فترة من الحادثة اخرج أهل قيسارية من أرضهم فقدموا نحو الطنطورية فاستضافوهم. استعد الأهالي لمواجهة العدو فحصلوا على السلاح وتدربوا جيدًا ليتمكنوا من هزيمة العدو وأصبحت المقاومة هدف الجميع.  بعد فترة من هذا الاستقرار وفي إحدى الليالي استفاق أهل يافا على حادثة مغادرة البريطانيين ودخول اليهود إلى فلسطين وأرادوا فرض دولة تدعى إسرائيل. استعد العرب لمواجهة هذا العدو المشترك فخاضوا حروبًا كثيرة، لكن ذلك لم يجد نفعًا فتتالت الخيبات وظل هذا الهدف حلمًا عربيًا يطمح إليه الجميع. ",R.drawable.tantorea);
        Books books1 = new Books("حديث الجنود ","للكاتب : ايمن العتوم","الرواية مقتبسة عن أحداث حقيقية ( منعت من النشر من قبل دائرة المطبوعات الأردنية حين وصلت إلى الأردن ) . فالرواية عبارة عن توثيق لأحداث ، تواريخ ، أماكن ومواقف مهمة . تتحدث الرواية عن أحداث جامعة اليرموك في الأردن التي وقعت في الثمانينات ، حيث أصدرت الجامعة قرارا مجحفا في حق الطلبة برفع الرسوم الخاصة بالتدريب الصيفي ، لتقوم بعدها المظاهرات والاحتجاجات للعدول عن هذا القرار وما رافقه من تدخلات قوية للأمن والجيش لتنتهي نهاية مأساوية ! . تناولت الرواية عدة مواضيع : و القضايا الاجتماعية والسياسية . و دور الأحزاب والتيارات ( الإخوان ، اليساريين وغيرهم ) في تلك الأحداث الحب والوفاء والتضحية والذي كان واضحا في قصة الخالة \" نعيمة \" التي كانت مثالا للإخلاص والوفاء المطلق لزوجها المتوفي .\n",R.drawable.solders);
        Books books2 = new Books("العنكبوت ","للكاتب : مصطفى محمود ","لدكتور م.داود دكتوراة في جراحة المخ والأعصاب من جامعة برلين، يريد أن يكشف لنا عن سر بعد ما تخطي سن الستين، و هذا السر حمله لسنين طويلة، لكن هذا السر لم يخبره في شكل دراسة بل قاله في شكل قصة، والقصة بتبدي في شتاء عام 1958 في غرفة الكشف بعيادة الدكتور داود حين طرق علي بابه أول زائر وكان شاب نحيل صفراوي النظرات ذو وجه شاحب، جاء للدكتور داود بعد ماتم تحويله من دكتور اَخر بعد ما اشتبه أن لديه ورم في المخ، دكتور داود أندهش بعد ما عرف أن كل ما يعاني منه هو صداع مزمن وزغللة في العين فقط، علي الرغم من أن هذه الأعراض يمكن أن تكون موجودة في ألف مرض.\n" +
                "فلماذا الدكتور فكر أن لديه ورم في المخ ؟ \n" +
                "وما هي حكاية هذا الراجل ؟ \n" +
                "وما هو السر الذي يريد دكتور داود كشفه لنا ؟\n",R.drawable.spider);
        Books books3 = new Books("خاوية ","للكاتب : ايمن العتوم ","الرواية تتحدث عن النهايات الكبرى للكون ، وتعتمد على مرجعيات دينية وعلمية وتاريخية في المفاضلة بين الإنس والجن . ولا تعرف الفترة الزمنية التي تعالجها الرواية ، بل تمتد في كل الأزمنة وتنتشر في أمكنة واقعية وأخرى متخيلة ، وتكشف عن الإرادة البشرية المتذبذبة في خضوعها لقوى الشر ، وسيطرة الظلام على الأرض بما كسبت يدا الإنسان.\n",R.drawable.empty);
        Books books4 = new Books("خرائط التيه ","للكاتبه : بثينه العيسى","تدور احداث الرواية عن مشاري الذي يبلغ من العمر سبع أعوام ، فقده والداه أثناء رحلتهم إلى موسم الحج . ومن هنا تبدأ دوامة البحث المستمر لمدة اثنان وعشرين يوما والتي لن تكون مجرد رحلة بحث عادية بل ستكون رحلة من نوع آخر ، رحلة أعمق .. ستفتح أعينهم على الحقيقة وما يحدث وراء كواليس إختطاف الأطفال .\n",R.drawable.teh);
        Books books5 = new Books("رائحة التانغو","للكاتبة : دلع مفتي ","حين يتوارى الحب وترقص الخيانة على أوتار الضعف والخواء الروحي حين يكون الشذوذ ظاهرة والتطرف ستارا لقلوب بشعة أو جريحة عندما تلتهب العروق بأمومة لا تجد من تفرغها فيه حين تذرف الإنسانية دموعا على طفولة قتلها جشع التاجر وخبث السياسي وصمت الإعلامي . عندئذ .. تفوح رائحة التانغو .\n",R.drawable.tango);
        Books books6 = new Books("طعم الذئب","للكاتب : عبد الله البصيص","أظهر الذئب نفسه تاركا الاختباء ، توقف ذيبان فجأة ليستوثق من مقصده ، إذ لا يزال في داخله أمل يستخف بعقله بأنه لا يترصده ، ومن البعيد توقف الذئب مطرقا رأسه لليمين كأنه ينظر للجانب الآخر من الأفق ، لحظات وأعاده إلى ذيبان ثم دار حول نفسه وأقعى مؤخرته على الأرض . فهم ذيبان الحركة ، \" إيهبا \" تمتم بعدما تأكدت له مخاوفه . الذئب ينتظر الليل ليهجم ، يجب عليه الآن أن يتصرف وإلا فسيصبح عشاء لذئب تسري اللعنة في دمه ، \" لعنات وليست لعنة واحدة \"\n", R.drawable.smell);
        Books books7 = new Books("عروس المطر","للكاتبة : بثينة العيسى","في \" عروس المطر \" تشظيات أحلام وإخفاقات وهروب إلى عالم وردي حيث يتاح للروح التحليق في عوالم أثيرة ، ويطيب للنفس الغرق في استجراراتها الجميلة التي لا تنتهي . في \" عروس المطر \" تطرح الكاتبة من خلال شخصيتها المحورية أسماء حالات نفسية كاشفة عن المعاناة الإنسانية حين تعيش واقعاً خلوا من العواطف فيكون الهروب إلى العوالم الأكثر شفافية والأكثر حنوا هو السبيل إلى متابعة الحياة الكئيبة . وتشد أسماء هذه الرواية القارئ فيغرق معها في عوالمها التي تنسجها الكاتبة من خلال عبارات رائعة تفصح عن إبداعات روائية راقية .\n",R.drawable.rain );
        Books books8 = new Books("يوتوبيا","للكاتب : احمد خالد توفيق","تبدأ أحداث الرواية في المستقبل في مصر حيث انقسم المجتمع إلي طبقتين ، الطبقة الغنية ويطلق عليها \" يوتوبيا \" والطبقة الفقيرة يطلق عليها \" أرض الاغيار \" وتبدأ أحداث الرواية عندما قرر فتي من شعب يوتوبيا أن يفعل شيء جديد بعدما شعر بالملل من الحياة المرفهه قرر أن يكسر هذا الملل بالذهاب إلى أرض الاغيار لكي يصطاد أحد أفراد هذا المجتمع وهنا تبدأ المغامرة والتعرف علي حقيقة واخلاق شعب يوتوبيا التي يمثلها الشاب علاء و صديقته وسنتعرف علي الطبقة الفقيرة من خلال شخصية جابر والذي يكون مرشد علاء وصديقته في أرض الاغيار ويكون أيضا فريسة للشاب اليوتوبي هو واخته .\n",R.drawable.youtubya);
        Books books9 = new Books("جثة في بيت طائر الدود","للكاتبة : منى سلامة","هل تشعر أن العالم مكان خانق، وأن اليد التي تمدها له بالوِد يصفعها بالخذلان؟\n" +
                "هل تشعر أن العالم بهشاشة عجوز بلغ الستين، وبقسوة مطرقة تسقط فوق رأسك بوتيرة ثابتة؟\n" +
                "\"لوط\" أيضًا يرى العالم من النافذة ذاتها التي تنظر أنت منها، ظل واقفًا أمامها يُقلِّبه الزمن، حتى استيقظ ذات مساء متفاجئًا بجثة في فراشه.\n" +
                "لم يكن عثوره على الجثة سوى الحدث الأول من سلسلة أحداث غرائبية ستقع له في تلك الليلة، وبخاصةٍ عندما تطرُق بابه ليلًا ضيفة عجيبة تحمل حقيبة قماشية تسَع العالم.",R.drawable.baird);




        BooksArrayList.add(books);
        BooksArrayList.add(books1);
        BooksArrayList.add(books2);
        BooksArrayList.add(books3);
        BooksArrayList.add(books4);
        BooksArrayList.add(books5);
        BooksArrayList.add(books6);
        BooksArrayList.add(books7);
        BooksArrayList.add(books8);
        BooksArrayList.add(books9);



        BooksAdapter Students = new BooksAdapter(this,0,BooksArrayList);

        ListView listView = findViewById(R.id.listview5);
        listView.setAdapter(Students);

        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Books currentBook = BooksArrayList.get(i);
                Intent intent = new Intent(MainActivity2.this,detailesactivity.class);
                intent.putExtra("Books",currentBook);
                startActivity(intent);
            }
        });






    }

}